# PANDAS PYTHON - Time Series (partie 2)

URL : https://youtu.be/qHRLG5hsW9I?si=d7vYaqzNSINM0wrY

In [3]:
#importations
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

# Transformer les catégories en données numériques:
# map(), replace(), cat.codes

In [5]:
#lire le fichier excel des passagers du Titanic (PANDAS PYTHON - Introduction + Analyse du Titanic)
#enregistrer le dataset dans une variable appelée data
data= pd.read_excel('titanic3.xls')

#afficher les 5 premières lignes de data
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

Pour faire des calculs (ML, stats,...etc), il faut absolument avoir des données numériques.

**Pour convertir les données**, on utilise:
- map()
- replace()
- cat.codes

## cat.codes

Cette méthode est la plus facile à utiliser, surtout si on a beaucoup de valeurs (non numériques) à convertir (en données numériques) dans une colonne.

In [9]:
#afficher la colonne sex de data
data['sex']

0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: object

In [10]:
#dtype: object

In [11]:
data['sex'].astype('category')

0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: category
Categories (2, object): ['female', 'male']

**.astype('category') :** Cette méthode de pandas est utilisée pour changer le type des données de la colonne. En passant 'category', on indique que les valeurs de cette colonne doivent être traitées comme des catégories distinctes.

In [13]:
#dtype: category
#Categories (2, object): ['female', 'male']

#ça determine le type de la colonne, les valeurs dans cette colonne et le nombre de ces valeurs,...etc

In [14]:
#cat.codes pour convertir la colonne sex en données numériques
data['sex'].astype('category').cat.codes

0       0
1       1
2       0
3       1
4       0
       ..
1304    0
1305    0
1306    1
1307    1
1308    1
Length: 1309, dtype: int8

## replace()

In [16]:
#afficher la colonne sex du dataframe data
data['sex']

0       female
1         male
2       female
3         male
4       female
         ...
1304    female
1305    female
1306      male
1307      male
1308      male
Name: sex, Length: 1309, dtype: object

In [17]:
#convertir la colonne sex en données numériques en utilisant replace()
#ça permet de remplacer les éléments de la 1ère liste par les éléments de la 2ème liste
data['sex'].replace(['male', 'female'], [0, 1])

C:\Users\HP\AppData\Local\Temp\ipykernel_15936\3736847801.py:3: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  data['sex'].replace(['male', 'female'], [0, 1])

0       1
1       0
2       1
3       0
4       1
       ..
1304    1
1305    1
1306    0
1307    0
1308    0
Name: sex, Length: 1309, dtype: int64

## map()

In [19]:
#convertir la colonne sex en données numériques en utilisant map()
#on change les valeurs une par une
data['sex'].map({'male': 0, 'female': 1})

0       1
1       0
2       1
3       0
4       1
       ..
1304    1
1305    1
1306    0
1307    0
1308    0
Name: sex, Length: 1309, dtype: int64